VictorDanielHerHur/Librer-a-/stm32f407g (2).h
/*
 * stm32f407g_uteq.h
 *
 *  Created on: Jul 9, 2026
 *      Author: De Leòn Montes
 */

#ifndef STM32F407G_H_
#define STM32F407G_H_

#include <stdint.h>

/********************************** Library for RCC **********************************/
#define ADDR_RCC_BASE       0x40023800UL

#define RCC_OFFSET_AHB1ENR  0x30UL
#define RCC_OFFSET_APB1ENR  0x40UL
#define RCC_OFFSET_APB2ENR  0x44UL

/* RCC_AHB1ENR */
typedef struct
{
    uint32_t gpioa_en       : 1;
    uint32_t gpiob_en       : 1;
    uint32_t gpioc_en       : 1;
    uint32_t gpiod_en       : 1;
    uint32_t gpioe_en       : 1;
    uint32_t gpiof_en       : 1;
    uint32_t gpiog_en       : 1;
    uint32_t gpioh_en       : 1;
    uint32_t gpioi_en       : 1;
    uint32_t gpioj_en       : 1;
    uint32_t gpiok_en       : 1;
    uint32_t reserved1      : 1;
    uint32_t crc_en         : 1;
    uint32_t reserved2      : 5;
    uint32_t bkpsramen      : 1;
    uint32_t reserved3      : 1;
    uint32_t ccmdataram_en  : 1;
    uint32_t dma1_en        : 1;
    uint32_t dma2_en        : 1;
    uint32_t dma2d_en       : 1;
    uint32_t reserved4      : 1;
    uint32_t ethmac_en      : 1;
    uint32_t ethmactx_en    : 1;
    uint32_t ethmacrx_en    : 1;
    uint32_t ethmacptp_en   : 1;
    uint32_t otghs_en       : 1;
    uint32_t otghsulpi_en   : 1;
    uint32_t reserved5      : 1;
}RCC_AHB1ENR_t;

#define ADDR_RCC_AHB1ENR    ((volatile RCC_AHB1ENR_t*)(ADDR_RCC_BASE + RCC_OFFSET_AHB1ENR))


/* RCC_APB1ENR */
typedef struct
{
    uint32_t tim2en      : 1;  /* Bit 0: TIM2 clock enable */
    uint32_t tim3en      : 1;  /* Bit 1: TIM3 clock enable */
    uint32_t tim4en      : 1;  /* Bit 2: TIM4 clock enable */
    uint32_t tim5en      : 1;  /* Bit 3: TIM5 clock enable */
    uint32_t tim6en      : 1;  /* Bit 4: TIM6 clock enable */
    uint32_t tim7en      : 1;  /* Bit 5: TIM7 clock enable */
    uint32_t tim12en     : 1;  /* Bit 6: TIM12 clock enable */
    uint32_t tim13en     : 1;  /* Bit 7: TIM13 clock enable */
    uint32_t tim14en     : 1;  /* Bit 8: TIM14 clock enable */
    uint32_t reserved1   : 2;  /* Bits 9-10: Reserved */
    uint32_t wwdgen      : 1;  /* Bit 11: Window watchdog clock enable */
    uint32_t reserved2   : 2;  /* Bits 12-13: Reserved */
    uint32_t spi2en      : 1;  /* Bit 14: SPI2 clock enable */
    uint32_t spi3en      : 1;  /* Bit 15: SPI3 clock enable */
    uint32_t reserved3   : 1;  /* Bit 16: Reserved */
    uint32_t usart2en    : 1;  /* Bit 17: USART2 clock enable */
    uint32_t usart3en    : 1;  /* Bit 18: USART3 clock enable */
    uint32_t uart4en     : 1;  /* Bit 19: UART4 clock enable */
    uint32_t uart5en     : 1;  /* Bit 20: UART5 clock enable */
    uint32_t i2c1en      : 1;  /* Bit 21: I2C1 clock enable */
    uint32_t i2c2en      : 1;  /* Bit 22: I2C2 clock enable */
    uint32_t i2c3en      : 1;  /* Bit 23: I2C3 clock enable */
    uint32_t reserved4   : 1;  /* Bit 24: Reserved */
    uint32_t can1en      : 1;  /* Bit 25: CAN1 clock enable */
    uint32_t can2en      : 1;  /* Bit 26: CAN2 clock enable */
    uint32_t reserved5   : 1;  /* Bit 27: Reserved */
    uint32_t pwren       : 1;  /* Bit 28: Power interface clock enable */
    uint32_t dacen       : 1;  /* Bit 29: DAC interface clock enable */
    uint32_t uart7en     : 1;  /* Bit 30: UART7 clock enable */
    uint32_t uart8en     : 1;  /* Bit 31: UART8 clock enable */
} RCC_APB1ENR_t;

#define ADDR_RCC_APB1ENR    ((volatile RCC_APB1ENR_t*)(ADDR_RCC_BASE + RCC_OFFSET_APB1ENR))


/* RCC_APB2ENR */
typedef struct
{
    uint32_t tim1_en        : 1;
    uint32_t tim8_en        : 1;
    uint32_t reserved1      : 2;
    uint32_t usart1_en      : 1;
    uint32_t usart6_en      : 1;
    uint32_t reserved2      : 2;
    uint32_t adc1_en        : 1;
    uint32_t adc2_en        : 1;
    uint32_t adc3_en        : 1;
    uint32_t sdio_en        : 1;
    uint32_t spi1_en        : 1;
    uint32_t spi4_en        : 1;
    uint32_t syscfg_en      : 1;
    uint32_t reserved3      : 1;
    uint32_t tim9_en        : 1;
    uint32_t tim10_en       : 1;
    uint32_t tim11_en       : 1;
    uint32_t reserved4      : 1;
    uint32_t spi5_en        : 1;
    uint32_t spi6_en        : 1;
    uint32_t sai1_en        : 1;
    uint32_t reserved5      : 3;
    uint32_t ltdc_en        : 1;
    uint32_t reserved6      : 5;
}RCC_APB2ENR_t;

#define ADDR_RCC_APB2ENR    ((volatile RCC_APB2ENR_t*)(ADDR_RCC_BASE + RCC_OFFSET_APB2ENR))




/********************************** Library for GPIO **********************************/
#define ADDR_GPIOA_BASE     0x40020000UL
#define ADDR_GPIOB_BASE     0x40020400UL
#define ADDR_GPIOC_BASE     0x40020800UL
#define ADDR_GPIOD_BASE     0x40020C00UL
#define ADDR_GPIOE_BASE     0x40021000UL
#define ADDR_GPIOF_BASE     0x40021400UL
#define ADDR_GPIOG_BASE     0x40021800UL
#define ADDR_GPIOH_BASE     0x40021C00UL
#define ADDR_GPIOI_BASE     0x40022000UL

#define GPIO_OFFSET_MODER   0x00UL
#define GPIO_OFFSET_OTYPER  0x04UL
#define GPIO_OFFSET_OSPEEDR 0x08UL
#define GPIO_OFFSET_PUPDR   0x0CUL
#define GPIO_OFFSET_IDR	    0x10UL
#define GPIO_OFFSET_ODR	    0x14UL
#define GPIO_OFFSET_BSRR    0x18UL
#define GPIO_OFFSET_LCKR    0x1CUL
#define GPIO_OFFSET_AFRL    0x20UL
#define GPIO_OFFSET_AFRH    0x24UL


/* GPIOx_MODER */
typedef struct
{
    uint32_t moder0 : 2;
    uint32_t moder1 : 2;
    uint32_t moder2 : 2;
    uint32_t moder3 : 2;
    uint32_t moder4 : 2;
    uint32_t moder5 : 2;
    uint32_t moder6 : 2;
    uint32_t moder7 : 2;
    uint32_t moder8 : 2;
    uint32_t moder9 : 2;
    uint32_t moder10 : 2;
    uint32_t moder11 : 2;
    uint32_t moder12 : 2;
    uint32_t moder13 : 2;
    uint32_t moder14 : 2;
    uint32_t moder15 : 2;
}GPIOx_MODER_t;

#define ADDR_GPIOA_MODER    ((volatile GPIOx_MODER_t*)(ADDR_GPIOA_BASE + GPIO_OFFSET_MODER))
#define ADDR_GPIOB_MODER    ((volatile GPIOx_MODER_t*)(ADDR_GPIOB_BASE + GPIO_OFFSET_MODER))
#define ADDR_GPIOC_MODER    ((volatile GPIOx_MODER_t*)(ADDR_GPIOC_BASE + GPIO_OFFSET_MODER))
#define ADDR_GPIOD_MODER    ((volatile GPIOx_MODER_t*)(ADDR_GPIOD_BASE + GPIO_OFFSET_MODER))
#define ADDR_GPIOE_MODER    ((volatile GPIOx_MODER_t*)(ADDR_GPIOE_BASE + GPIO_OFFSET_MODER))
#define ADDR_GPIOF_MODER    ((volatile GPIOx_MODER_t*)(ADDR_GPIOF_BASE + GPIO_OFFSET_MODER))
#define ADDR_GPIOG_MODER    ((volatile GPIOx_MODER_t*)(ADDR_GPIOG_BASE + GPIO_OFFSET_MODER))
#define ADDR_GPIOH_MODER    ((volatile GPIOx_MODER_t*)(ADDR_GPIOH_BASE + GPIO_OFFSET_MODER))
#define ADDR_GPIOI_MODER    ((volatile GPIOx_MODER_t*)(ADDR_GPIOI_BASE + GPIO_OFFSET_MODER))


/* GPIOx_PUPDR */
typedef struct
{
        uint32_t pupdr0 : 2;
        uint32_t pupdr1 : 2;
        uint32_t pupdr2 : 2;
        uint32_t pupdr3 : 2;
        uint32_t pupdr4 : 2;
        uint32_t pupdr5 : 2;
        uint32_t pupdr6 : 2;
        uint32_t pupdr7 : 2;
        uint32_t pupdr8 : 2;
        uint32_t pupdr9 : 2;
        uint32_t pupdr10 : 2;
        uint32_t pupdr11 : 2;
        uint32_t pupdr12 : 2;
        uint32_t pupdr13 : 2;
        uint32_t pupdr14 : 2;
        uint32_t pupdr15 : 2;
}GPIOx_PUPDR_t;

#define ADDR_GPIOA_PUPDR     ((volatile GPIOx_PUPDR_t *)(ADDR_GPIOA_BASE + GPIO_OFFSET_PUPDR))
#define ADDR_GPIOB_PUPDR     ((volatile GPIOx_PUPDR_t *)(ADDR_GPIOB_BASE + GPIO_OFFSET_PUPDR))
#define ADDR_GPIOC_PUPDR     ((volatile GPIOx_PUPDR_t *)(ADDR_GPIOC_BASE + GPIO_OFFSET_PUPDR))
#define ADDR_GPIOD_PUPDR     ((volatile GPIOx_PUPDR_t *)(ADDR_GPIOD_BASE + GPIO_OFFSET_PUPDR))
#define ADDR_GPIOE_PUPDR     ((volatile GPIOx_PUPDR_t *)(ADDR_GPIOE_BASE + GPIO_OFFSET_PUPDR))
#define ADDR_GPIOF_PUPDR     ((volatile GPIOx_PUPDR_t *)(ADDR_GPIOF_BASE + GPIO_OFFSET_PUPDR))
#define ADDR_GPIOG_PUPDR     ((volatile GPIOx_PUPDR_t *)(ADDR_GPIOG_BASE + GPIO_OFFSET_PUPDR))
#define ADDR_GPIOH_PUPDR     ((volatile GPIOx_PUPDR_t *)(ADDR_GPIOH_BASE + GPIO_OFFSET_PUPDR))
#define ADDR_GPIOI_PUPDR     ((volatile GPIOx_PUPDR_t *)(ADDR_GPIOI_BASE + GPIO_OFFSET_PUPDR))


/* GPIOx_IDR */
typedef struct
{
    uint32_t idr0 : 1;
    uint32_t ide1 : 1;
    uint32_t idr2 : 1;
    uint32_t idr3 : 1;
    uint32_t idr4 : 1;
    uint32_t idr5 : 1;
    uint32_t idr6 : 1;
    uint32_t idr7 : 1;
    uint32_t idr8 : 1;
    uint32_t idr9 : 1;
    uint32_t idr10 : 1;
    uint32_t idr11 : 1;
    uint32_t idr12 : 1;
    uint32_t idr13 : 1;
    uint32_t idr14 : 1;
    uint32_t idr15 : 1;
    uint32_t reserved : 16;
}GPIOx_IDR_t;

#define ADDR_GPIOA_IDR     ((volatile GPIOx_IDR_t *)(ADDR_GPIOA_BASE + GPIO_OFFSET_IDR))
#define ADDR_GPIOB_IDR     ((volatile GPIOx_IDR_t *)(ADDR_GPIOB_BASE + GPIO_OFFSET_IDR))
#define ADDR_GPIOC_IDR     ((volatile GPIOx_IDR_t *)(ADDR_GPIOC_BASE + GPIO_OFFSET_IDR))
#define ADDR_GPIOD_IDR     ((volatile GPIOx_IDR_t *)(ADDR_GPIOD_BASE + GPIO_OFFSET_IDR))
#define ADDR_GPIOE_IDR     ((volatile GPIOx_IDR_t *)(ADDR_GPIOE_BASE + GPIO_OFFSET_IDR))
#define ADDR_GPIOF_IDR     ((volatile GPIOx_IDR_t *)(ADDR_GPIOF_BASE + GPIO_OFFSET_IDR))
#define ADDR_GPIOG_IDR     ((volatile GPIOx_IDR_t *)(ADDR_GPIOG_BASE + GPIO_OFFSET_IDR))
#define ADDR_GPIOH_IDR     ((volatile GPIOx_IDR_t *)(ADDR_GPIOH_BASE + GPIO_OFFSET_IDR))
#define ADDR_GPIOI_IDR     ((volatile GPIOx_IDR_t *)(ADDR_GPIOI_BASE + GPIO_OFFSET_IDR))


/* GPIOx_ODR */
typedef struct
{
    uint32_t odr0 : 1;
    uint32_t odr1 : 1;
    uint32_t odr2 : 1;
    uint32_t odr3 : 1;
    uint32_t odr4 : 1;
    uint32_t odr5 : 1;
    uint32_t odr6 : 1;
    uint32_t odr7 : 1;
    uint32_t odr8 : 1;
    uint32_t odr9 : 1;
    uint32_t odr10 : 1;
    uint32_t odr11 : 1;
    uint32_t odr12 : 1;
    uint32_t odr13 : 1;
    uint32_t odr14 : 1;
    uint32_t odr15 : 1;
    uint32_t reserved : 16;
}GPIOx_ODR_t;

