VictorDanielHerHur/Librer-a-/stm32f407g (2).h
#define ADDR_GPIOA_ODR     ((volatile GPIOx_ODR_t *)(ADDR_GPIOA_BASE + GPIO_OFFSET_ODR))
#define ADDR_GPIOB_ODR     ((volatile GPIOx_ODR_t *)(ADDR_GPIOB_BASE + GPIO_OFFSET_ODR))
#define ADDR_GPIOC_ODR     ((volatile GPIOx_ODR_t *)(ADDR_GPIOC_BASE + GPIO_OFFSET_ODR))
#define ADDR_GPIOD_ODR     ((volatile GPIOx_ODR_t *)(ADDR_GPIOD_BASE + GPIO_OFFSET_ODR))
#define ADDR_GPIOE_ODR     ((volatile GPIOx_ODR_t *)(ADDR_GPIOE_BASE + GPIO_OFFSET_ODR))
#define ADDR_GPIOF_ODR     ((volatile GPIOx_ODR_t *)(ADDR_GPIOF_BASE + GPIO_OFFSET_ODR))
#define ADDR_GPIOG_ODR     ((volatile GPIOx_ODR_t *)(ADDR_GPIOG_BASE + GPIO_OFFSET_ODR))
#define ADDR_GPIOH_ODR     ((volatile GPIOx_ODR_t *)(ADDR_GPIOH_BASE + GPIO_OFFSET_ODR))
#define ADDR_GPIOI_ODR     ((volatile GPIOx_ODR_t *)(ADDR_GPIOI_BASE + GPIO_OFFSET_ODR))

/* GPIOx_AFRL */
typedef struct 
{
    uint32_t AFRL0 : 4;  // Bits 0-3:   Alternate function selection for port x pin 0
    uint32_t AFRL1 : 4;  // Bits 4-7:   Alternate function selection for port x pin 1
    uint32_t AFRL2 : 4;  // Bits 8-11:  Alternate function selection for port x pin 2
    uint32_t AFRL3 : 4;  // Bits 12-15: Alternate function selection for port x pin 3
    uint32_t AFRL4 : 4;  // Bits 16-19: Alternate function selection for port x pin 4
    uint32_t AFRL5 : 4;  // Bits 20-23: Alternate function selection for port x pin 5
    uint32_t AFRL6 : 4;  // Bits 24-27: Alternate function selection for port x pin 6
    uint32_t AFRL7 : 4;  // Bits 28-31: Alternate function selection for port x pin 7
}GPIOx_AFRL_t;;
#define ADDR_GPIOA_AFRL     ((volatile GPIOx_AFRL_t*)(ADDR_GPIOA_BASE + GPIO_OFFSET_AFRL))
#define ADDR_GPIOB_AFRL     ((volatile GPIOx_AFRL_t*)(ADDR_GPIOB_BASE + GPIO_OFFSET_AFRL))
#define ADDR_GPIOC_AFRL     ((volatile GPIOx_AFRL_t*)(ADDR_GPIOC_BASE + GPIO_OFFSET_AFRL))
#define ADDR_GPIOD_AFRL     ((volatile GPIOx_AFRL_t*)(ADDR_GPIOD_BASE + GPIO_OFFSET_AFRL))
#define ADDR_GPIOE_AFRL     ((volatile GPIOx_AFRL_t*)(ADDR_GPIOE_BASE + GPIO_OFFSET_AFRL))
#define ADDR_GPIOF_AFRL     ((volatile GPIOx_AFRL_t*)(ADDR_GPIOF_BASE + GPIO_OFFSET_AFRL))
#define ADDR_GPIOG_AFRL     ((volatile GPIOx_AFRL_t*)(ADDR_GPIOG_BASE + GPIO_OFFSET_AFRL))
#define ADDR_GPIOH_AFRL     ((volatile GPIOx_AFRL_t*)(ADDR_GPIOH_BASE + GPIO_OFFSET_AFRL))
#define ADDR_GPIOI_AFRL     ((volatile GPIOx_AFRL_t*)(ADDR_GPIOI_BASE + GPIO_OFFSET_AFRL))


/* GPIOx_AFRH */
typedef struct 
{
    uint32_t AFRH8 : 4;  // Bits 0-3:   Alternate function selection for port x pin 0
    uint32_t AFRH9 : 4;  // Bits 4-7:   Alternate function selection for port x pin 1
    uint32_t AFRH10 : 4;  // Bits 8-11:  Alternate function selection for port x pin 2
    uint32_t AFRH11 : 4;  // Bits 12-15: Alternate function selection for port x pin 3
    uint32_t AFRH12 : 4;  // Bits 16-19: Alternate function selection for port x pin 4
    uint32_t AFRH13 : 4;  // Bits 20-23: Alternate function selection for port x pin 5
    uint32_t AFRH14 : 4;  // Bits 24-27: Alternate function selection for port x pin 6
    uint32_t AFRH15 : 4;  // Bits 28-31: Alternate function selection for port x pin 7
}GPIOx_AFRH_t;;
#define ADDR_GPIOA_AFRH     ((volatile GPIOx_AFRH_t*)(ADDR_GPIOA_BASE + GPIO_OFFSET_AFRH))
#define ADDR_GPIOB_AFRH     ((volatile GPIOx_AFRH_t*)(ADDR_GPIOB_BASE + GPIO_OFFSET_AFRH))
#define ADDR_GPIOC_AFRH     ((volatile GPIOx_AFRH_t*)(ADDR_GPIOC_BASE + GPIO_OFFSET_AFRH))
#define ADDR_GPIOD_AFRH     ((volatile GPIOx_AFRH_t*)(ADDR_GPIOD_BASE + GPIO_OFFSET_AFRH))
#define ADDR_GPIOE_AFRH     ((volatile GPIOx_AFRH_t*)(ADDR_GPIOE_BASE + GPIO_OFFSET_AFRH))
#define ADDR_GPIOF_AFRH     ((volatile GPIOx_AFRH_t*)(ADDR_GPIOF_BASE + GPIO_OFFSET_AFRH))
#define ADDR_GPIOG_AFRH     ((volatile GPIOx_AFRH_t*)(ADDR_GPIOG_BASE + GPIO_OFFSET_AFRH))
#define ADDR_GPIOH_AFRH     ((volatile GPIOx_AFRH_t*)(ADDR_GPIOH_BASE + GPIO_OFFSET_AFRH))
#define ADDR_GPIOI_AFRH     ((volatile GPIOx_AFRH_t*)(ADDR_GPIOI_BASE + GPIO_OFFSET_AFRH))


/********************************** Library for ADC **********************************/
#define ADDR_ADC1_BASE      0x40012000UL
#define ADDR_ADC2_BASE      0x40012100UL
#define ADDR_ADC3_BASE      0x40012200UL

#define ADC_OFFSET_SR       0x00UL
#define ADC_OFFSET_CR1      0x04UL
#define ADC_OFFSET_CR2      0x08UL
#define ADC_OFFSET_SQR1     0x2CUL
#define ADC_OFFSET_SQR3     0x34UL
#define ADC_OFFSET_DR       0x4CUL
#define ADC_OFFSET_CCR      0x304UL

/* ADC_SR */
typedef struct
{
    uint32_t awd       : 1;  /* Bit 0: Analog watchdog flag */
    uint32_t eoc       : 1;  /* Bit 1: Regular channel end of conversion */
    uint32_t jeoc      : 1;  /* Bit 2: Injected channel end of conversion */
    uint32_t jstrt     : 1;  /* Bit 3: Injected channel start flag */
    uint32_t strt      : 1;  /* Bit 4: Regular channel start flag */
    uint32_t ovr       : 1;  /* Bit 5: Overrun flag */
    uint32_t reserved  : 26; /* Bits 26-31: Reserved, must be kept at reset value */
} ADC_SR_t;

#define ADDR_ADC1_SR        ((volatile ADC_SR_t*)(ADDR_ADC1_BASE + ADC_OFFSET_SR))
#define ADDR_ADC2_SR        ((volatile ADC_SR_t*)(ADDR_ADC2_BASE + ADC_OFFSET_SR))
#define ADDR_ADC3_SR        ((volatile ADC_SR_t*)(ADDR_ADC3_BASE + ADC_OFFSET_SR))


/* ADC_CR1 */
typedef struct
{
    uint32_t awdch      : 5;  /* Bits 0-4: Analog watchdog channel select bits */
    uint32_t eocie      : 1;  /* Bit 5: Interrupt enable for EOC */
    uint32_t awdie      : 1;  /* Bit 6: Analog watchdog interrupt enable */
    uint32_t jeocie     : 1;  /* Bit 7: Interrupt enable for injected channels */
    uint32_t scan       : 1;  /* Bit 8: Scan mode */
    uint32_t awdsgl     : 1;  /* Bit 9: Enable the watchdog on a single channel in single conversion mode */
    uint32_t jauto      : 1;  /* Bit 10: Automatic injected group conversion */
    uint32_t discen     : 1;  /* Bit 11: Discontinuous mode on regular channels */
    uint32_t jdiscen    : 1;  /* Bit 12: Discontinuous mode on injected channels */
    uint32_t discnum    : 3;  /* Bits 13-15: Discontinuous mode channel count */
    uint32_t reserved1  : 6;  /* Bits 16-21: Reserved, must be kept at reset value */
    uint32_t jawden     : 1;  /* Bit 22: Analog watchdog enable on injected channels */
    uint32_t awden      : 1;  /* Bit 23: Analog watchdog enable on regular channels */
    uint32_t res        : 2;  /* Bits 24-25: ADC resolution (00: 12-bit, 01: 10-bit, 10: 8-bit, 11: 6-bit) */
    uint32_t ovrie      : 1;  /* Bit 26: Overrun interrupt enable */
    uint32_t reserved2  : 5;  /* Bits 27-31: Reserved, must be kept at reset value */
} ADC_CR1_t;

#define ADDR_ADC1_CR1       ((volatile ADC_CR1_t*)(ADDR_ADC1_BASE + ADC_OFFSET_CR1))
#define ADDR_ADC2_CR1       ((volatile ADC_CR1_t*)(ADDR_ADC2_BASE + ADC_OFFSET_CR1))
#define ADDR_ADC3_CR1       ((volatile ADC_CR1_t*)(ADDR_ADC3_BASE + ADC_OFFSET_CR1))

/* ADC_CR2 */
typedef struct
{
    uint32_t adon       : 1;  /* Bit 0: A/D Converter ON / OFF */
    uint32_t cont       : 1;  /* Bit 1: Continuous conversion */
    uint32_t reserved1  : 6;  /* Bits 2-7: Reserved, must be kept at reset value */
    uint32_t dma        : 1;  /* Bit 8: Direct memory access mode */
    uint32_t dds        : 1;  /* Bit 9: DMA disable selection (for single ADC mode) */
    uint32_t eocs       : 1;  /* Bit 10: End of conversion selection */
    uint32_t align      : 1;  /* Bit 11: Data alignment (0: Right alignment, 1: Left alignment) */
    uint32_t reserved2  : 4;  /* Bits 12-15: Reserved, must be kept at reset value */
    uint32_t jextsel    : 4;  /* Bits 16-19: External trigger conversion select for injected channels */
    uint32_t jexten     : 2;  /* Bits 20-21: External trigger enable for injected channels */
    uint32_t jswstart   : 1;  /* Bit 22: Start conversion of injected channels */
    uint32_t reserved3  : 1;  /* Bit 23: Reserved, must be kept at reset value */
    uint32_t extsel     : 4;  /* Bits 24-27: External trigger conversion select for regular channels */
    uint32_t exten      : 2;  /* Bits 28-29: External trigger enable for regular channels */
    uint32_t swstart    : 1;  /* Bit 30: Start conversion of regular channels */
    uint32_t reserved4  : 1;  /* Bit 31: Reserved, must be kept at reset value */
} ADC_CR2_t;

#define ADDR_ADC1_CR2       ((volatile ADC_CR2_t*)(ADDR_ADC1_BASE + ADC_OFFSET_CR2))
#define ADDR_ADC2_CR2       ((volatile ADC_CR2_t*)(ADDR_ADC2_BASE + ADC_OFFSET_CR2))
#define ADDR_ADC3_CR2       ((volatile ADC_CR2_t*)(ADDR_ADC3_BASE + ADC_OFFSET_CR2))

/* ADC_SQR1 */
typedef struct
{
    uint32_t sq13       : 5;  /* Bits 0-4: 13th conversion in regular sequence */
    uint32_t sq14       : 5;  /* Bits 5-9: 14th conversion in regular sequence */
    uint32_t sq15       : 5;  /* Bits 10-14: 15th conversion in regular sequence */
    uint32_t sq16_0     : 1;  /* Bit 15: Least significant bit of 16th conversion */
    uint32_t sq16_4_1   : 4;  /* Bits 16-19: Most significant bits of 16th conversion */
    uint32_t l          : 4;  /* Bits 20-23: Regular sequence length (0000: 1 conversion, ..., 1111: 16 conversions) */
    uint32_t reserved   : 8;  /* Bits 24-31: Reserved, must be kept at reset value */
} ADC_SQR1_t;

#define ADDR_ADC1_SQR1      ((volatile ADC_SQR1_t*)(ADDR_ADC1_BASE + ADC_OFFSET_SQR1))
#define ADDR_ADC2_SQR1      ((volatile ADC_SQR1_t*)(ADDR_ADC2_BASE + ADC_OFFSET_SQR1))
#define ADDR_ADC3_SQR1      ((volatile ADC_SQR1_t*)(ADDR_ADC3_BASE + ADC_OFFSET_SQR1))

/* ADC_SQR3 */
typedef struct
{
    uint32_t sq1        : 5;  /* Bits 0-4: 1st conversion in regular sequence */
    uint32_t sq2        : 5;  /* Bits 5-9: 2nd conversion in regular sequence */
    uint32_t sq3        : 5;  /* Bits 10-14: 3rd conversion in regular sequence */
    uint32_t sq4        : 5;  /* Bits 19-15: 4th conversion in regular sequence */
    uint32_t sq5        : 5;  /* Bits 20-24: 5th conversion in regular sequence */
    uint32_t sq6        : 5;  /* Bits 25-29: 6th conversion in regular sequence */
    uint32_t reserved   : 2;  /* Bits 30-31: Reserved, must be kept at reset value */
} ADC_SQR3_t;

#define ADDR_ADC1_SQR3      ((volatile ADC_SQR3_t*)(ADDR_ADC1_BASE + ADC_OFFSET_SQR3))
#define ADDR_ADC2_SQR3      ((volatile ADC_SQR3_t*)(ADDR_ADC2_BASE + ADC_OFFSET_SQR3))
#define ADDR_ADC3_SQR3      ((volatile ADC_SQR3_t*)(ADDR_ADC3_BASE + ADC_OFFSET_SQR3))

/* ADC_DR */
typedef struct
{
    uint32_t data       : 16; /* Bits 0-15: Regular data */
    uint32_t reserved   : 16; /* Bits 16-31: Reserved, must be kept at reset value */
} ADC_DR_t;

#define ADDR_ADC1_DR        ((volatile ADC_DR_t*)(ADDR_ADC1_BASE + ADC_OFFSET_DR))
#define ADDR_ADC2_DR        ((volatile ADC_DR_t*)(ADDR_ADC2_BASE + ADC_OFFSET_DR))
#define ADDR_ADC3_DR        ((volatile ADC_DR_t*)(ADDR_ADC3_BASE + ADC_OFFSET_DR))


/* ADC_CCR */
typedef struct
{
    uint32_t multi      : 5;  /* Bits 0-4: Multi-ADC mode selection */
    uint32_t reserved1  : 3;  /* Bits 5-7: Reserved, must be kept at reset value */
    uint32_t delay      : 4;  /* Bits 8-11: Delay between 2 sampling phases */
    uint32_t res        : 1;  /* Bit 12: Reserved, must be kept at reset value */
    uint32_t dds        : 1;  /* Bit 13: DMA disable selection (for multi-ADC mode) */
    uint32_t dma        : 2;  /* Bits 14-15: Direct memory access mode for multi-ADC mode */
    uint32_t adcpre     : 2;  /* Bits 16-17: ADC prescaler */
    uint32_t reserved2  : 4;  /* Bits 18-21: Reserved, must be kept at reset value */
    uint32_t vbate      : 1;  /* Bit 22: VBAT enable */
    uint32_t tsvrefe    : 1;  /* Bit 23: Temperature sensor and VREFINT enable */
    uint32_t reserved3  : 8;  /* Bits 24-31: Reserved, must be kept at reset value */
} ADC_CCR_t;

#define ADDR_ADC_CCR        ((volatile ADC_CCR_t*)(ADDR_ADC1_BASE + ADC_OFFSET_CCR))

/********************************** Library for timers **********************************/
/* TIM 2 to TIM5 registers */
#define ADDR_TIM3_BASE      0x40000400UL
#define ADDR_TIM4_BASE      0x40000800UL

#define TIM_OFFSET_CR1      0x00UL
#define TIM_OFFSET_CR2      0x04UL
#define TIM_OFFSET_DIER     0x0CUL
#define TIM_OFFSET_SR       0x10UL
#define TIM_OFFSET_EGR      0x14UL
#define TIM_OFFSET_CCMR1    0x18UL
#define TIM_OFFSET_CCER     0x20UL
#define TIM_OFFSET_PSC      0x28UL
#define TIM_OFFSET_ARR      0x2CUL
#define TIM_OFFSET_CCR1     0x34UL


/* TIMx_CR1 */
typedef struct
{
    uint32_t cen         : 1;  /* Bit 0: Counter enable */
    uint32_t udis        : 1;  /* Bit 1: Update disable */
    uint32_t urs         : 1;  /* Bit 2: Update request source */
    uint32_t opm         : 1;  /* Bit 3: One-pulse mode */
    uint32_t dir         : 1;  /* Bit 4: Direction */
    uint32_t cms         : 2;  /* Bits 5-6: Center-aligned mode selection */
    uint32_t arpe        : 1;  /* Bit 7: Auto-reload preload enable */
    uint32_t ckd         : 2;  /* Bits 8-9: Clock division */
    uint32_t reserved    : 22; /* Bits 10-31: Reserved, must be kept at reset value */
} TIM_CR1_t;

