VictorDanielHerHur/Librer-a-/stm32f407g (2).h
#define ADDR_TIM3_CR1       ((volatile TIM_CR1_t*)(ADDR_TIM3_BASE + TIM_OFFSET_CR1))
#define ADDR_TIM4_CR1       ((volatile TIM_CR1_t*)(ADDR_TIM4_BASE + TIM_OFFSET_CR1))

/* TIMx_CR2 */
typedef struct
{
    //uint32_t reserved1   : 4;  /* Bits 0-3: Reserved */
	uint32_t reserved1   : 3;  /* Bits 0-3: Reserved */
	uint32_t ccds        : 1;  /* Bit 3 Capture/compare DMA selection */
    uint32_t mms         : 3;  /* Bits 4-6: Master mode selection */
    uint32_t ti1s        : 1;  /* Bit 7: TI1 selection */
    uint32_t reserved2   : 24; /* Bits 8-31: Reserved */
} TIM_CR2_t;

#define ADDR_TIM3_CR2       ((volatile TIM_CR2_t*)(ADDR_TIM3_BASE + TIM_OFFSET_CR2))
#define ADDR_TIM4_CR2       ((volatile TIM_CR2_t*)(ADDR_TIM4_BASE + TIM_OFFSET_CR2))


/* TIMx_DIER */
typedef struct
{
    uint32_t uie         : 1;  /* Bit 0: Update interrupt enable */
    uint32_t cc1ie       : 1;  /* Bit 1: Capture/compare 1 interrupt enable */
    uint32_t cc2ie       : 1;  /* Bit 2: Capture/compare 2 interrupt enable */
    uint32_t cc3ie       : 1;  /* Bit 3: Capture/compare 3 interrupt enable */
    uint32_t cc4ie       : 1;  /* Bit 4: Capture/compare 4 interrupt enable */
    uint32_t reserved1   : 1;  /* Bit 5: Reserved */
    uint32_t tie         : 1;  /* Bit 6: Trigger interrupt enable */
    uint32_t reserved2   : 1;  /* Bit 7: Reserved */
    uint32_t ude         : 1;  /* Bit 8: Update DMA request enable */
    uint32_t cc1de       : 1;  /* Bit 9: Capture/compare 1 DMA request enable */
    uint32_t cc2de       : 1;  /* Bit 10: Capture/compare 2 DMA request enable */
    uint32_t cc3de       : 1;  /* Bit 11: Capture/compare 3 DMA request enable */
    uint32_t cc4de       : 1;  /* Bit 12: Capture/compare 4 DMA request enable */
    uint32_t reserved3   : 1;  /* Bit 13: Reserved */
    uint32_t tde         : 1;  /* Bit 14: Trigger DMA request enable */
    uint32_t reserved4   : 17; /* Bits 15-31: Reserved */
} TIM_DIER_t;

#define ADDR_TIM3_DIER      ((volatile TIM_DIER_t*)(ADDR_TIM3_BASE + TIM_OFFSET_DIER))
#define ADDR_TIM4_DIER      ((volatile TIM_DIER_t*)(ADDR_TIM4_BASE + TIM_OFFSET_DIER))


/* TIMx_SR */
typedef struct
{
    uint32_t uif         : 1;  /* Bit 0: Update interrupt flag */
    uint32_t cc1if       : 1;  /* Bit 1: Capture/compare 1 interrupt flag */
    uint32_t cc2if       : 1;  /* Bit 2: Capture/compare 2 interrupt flag */
    uint32_t cc3if       : 1;  /* Bit 3: Capture/compare 3 interrupt flag */
    uint32_t cc4if       : 1;  /* Bit 4: Capture/compare 4 interrupt flag */
    uint32_t reserved1   : 1;  /* Bit 5: Reserved */
    uint32_t tif         : 1;  /* Bit 6: Trigger interrupt flag */
    uint32_t reserved2   : 2;  /* Bits 7-8: Reserved */
    uint32_t cc1of       : 1;  /* Bit 9: Capture/Compare 1 overcapture flag */
    uint32_t cc2of       : 1;  /* Bit 10: Capture/Compare 2 overcapture flag */
    uint32_t cc3of       : 1;  /* Bit 11: Capture/Compare 3 overcapture flag */
    uint32_t cc4of       : 1;  /* Bit 12: Capture/Compare 4 overcapture flag */
    uint32_t reserved3   : 19; /* Bits 13-31: Reserved, must be kept at reset value */
} TIM_SR_t;

#define ADDR_TIM3_SR        ((volatile TIM_SR_t*)(ADDR_TIM3_BASE + TIM_OFFSET_SR))
#define ADDR_TIM4_SR        ((volatile TIM_SR_t*)(ADDR_TIM4_BASE + TIM_OFFSET_SR))


/* TIMx_EGR */
typedef struct
{
    uint32_t ug          : 1;  /* Bit 0: Update generation */
    uint32_t cc1g        : 1;  /* Bit 1: Capture/compare 1 generation */
    uint32_t cc2g        : 1;  /* Bit 2: Capture/compare 2 generation */
    uint32_t cc3g        : 1;  /* Bit 3: Capture/compare 3 generation */
    uint32_t cc4g        : 1;  /* Bit 4: Capture/compare 4 generation */
    uint32_t reserved1   : 1;  /* Bit 5: Reserved, must be kept at reset value */
    uint32_t tg          : 1;  /* Bit 6: Trigger generation */
    uint32_t reserved2   : 25; /* Bits 7-31: Reserved, must be kept at reset value */
} TIM_EGR_t;

#define ADDR_TIM3_EGR       ((volatile TIM_EGR_t*)(ADDR_TIM3_BASE + TIM_OFFSET_EGR))
#define ADDR_TIM4_EGR       ((volatile TIM_EGR_t*)(ADDR_TIM4_BASE + TIM_OFFSET_EGR))


/* TIMx_CCMR1 */
typedef struct
{
    union {
        /* Modo Output Compare (Salida) */
        struct {
            uint32_t cc1s     : 2;  /* Bits 0-1: Capture/Compare 1 selection */
            uint32_t oc1fe    : 1;  /* Bit 2: Output compare 1 fast enable */
            uint32_t oc1pe    : 1;  /* Bit 3: Output compare 1 preload enable */
            uint32_t oc1m     : 3;  /* Bits 4-6: Output compare 1 mode */
            uint32_t oc1ce    : 1;  /* Bit 7: Output compare 1 clear enable */
            uint32_t cc2s     : 2;  /* Bits 8-9: Capture/Compare 2 selection */
            uint32_t oc2fe    : 1;  /* Bit 10: Output compare 2 fast enable */
            uint32_t oc2pe    : 1;  /* Bit 11: Output compare 2 preload enable */
            uint32_t oc2m     : 3;  /* Bits 12-14: Output compare 2 mode */
            uint32_t oc2ce    : 1;  /* Bit 15: Output compare 2 clear enable */
        };

        /* Modo Input Capture (Entrada) */
        struct {
            uint32_t          : 2;  /* Bits 0-1: Mismos bits CC1S */
            uint32_t ic1psc   : 2;  /* Bits 2-3: Input capture 1 prescaler */
            uint32_t ic1f     : 4;  /* Bits 4-7: Input capture 1 filter */
            uint32_t          : 2;  /* Bits 8-9: Mismos bits CC2S */
            uint32_t ic2psc   : 2;  /* Bits 10-11: Input capture 2 prescaler */
            uint32_t ic2f     : 4;  /* Bits 12-15: Input capture 2 filter */
        };
    };
    uint32_t reserved         : 16; /* Bits 16-31: Reserved, must be kept at reset value */
} TIM_CCMR1_t;

#define ADDR_TIM3_CCMR1       ((volatile TIM_CCMR1_t*)(ADDR_TIM3_BASE + TIM_OFFSET_CCMR1))
#define ADDR_TIM4_CCMR1       ((volatile TIM_CCMR1_t*)(ADDR_TIM4_BASE + TIM_OFFSET_CCMR1))

/* TIMx_CCER */
typedef struct
{
    uint32_t cc1e        : 1;  /* Bit 0: Capture/Compare 1 output enable */
    uint32_t cc1p        : 1;  /* Bit 1: Capture/Compare 1 output polarity */
    uint32_t reserved1   : 1;  /* Bit 2: Reserved, must be kept at reset value */
    uint32_t cc1np       : 1;  /* Bit 3: Capture/Compare 1 output NP polarity */
    
    uint32_t cc2e        : 1;  /* Bit 4: Capture/Compare 2 output enable */
    uint32_t cc2p        : 1;  /* Bit 5: Capture/Compare 2 output polarity */
    uint32_t reserved2   : 1;  /* Bit 6: Reserved, must be kept at reset value */
    uint32_t cc2np       : 1;  /* Bit 7: Capture/Compare 2 output NP polarity */
    
