VictorDanielHerHur/Librer-a-/stm32f407g (2).h
    uint32_t cc3e        : 1;  /* Bit 8: Capture/Compare 3 output enable */
    uint32_t cc3p        : 1;  /* Bit 9: Capture/Compare 3 output polarity */
    uint32_t reserved3   : 1;  /* Bit 10: Reserved, must be kept at reset value */
    uint32_t cc3np       : 1;  /* Bit 11: Capture/Compare 3 output NP polarity */
    
    uint32_t cc4e        : 1;  /* Bit 12: Capture/Compare 4 output enable */
    uint32_t cc4p        : 1;  /* Bit 13: Capture/Compare 4 output polarity */
    uint32_t reserved4   : 1;  /* Bit 14: Reserved, must be kept at reset value */
    uint32_t cc4np       : 1;  /* Bit 15: Capture/Compare 4 output NP polarity */
    
    uint32_t reserved5   : 16; /* Bits 16-31: Reserved, must be kept at reset value */
} TIM_CCER_t;

#define ADDR_TIM3_CCER      ((volatile TIM_CCER_t*)(ADDR_TIM3_BASE + TIM_OFFSET_CCER))
#define ADDR_TIM4_CCER      ((volatile TIM_CCER_t*)(ADDR_TIM4_BASE + TIM_OFFSET_CCER))


/* TIMx_PSC */
typedef struct
{
    uint32_t psc         : 16; /* Bits 0-15: Prescaler value */
    uint32_t reserved    : 16; /* Bits 16-31: Reserved, must be kept at reset value */
} TIM_PSC_t;

#define ADDR_TIM3_PSC       ((volatile TIM_PSC_t*)(ADDR_TIM3_BASE + TIM_OFFSET_PSC))
#define ADDR_TIM4_PSC       ((volatile TIM_PSC_t*)(ADDR_TIM4_BASE + TIM_OFFSET_PSC))


/* TIMx_ARR */
typedef struct
{
    uint32_t arr_l       : 16; /* Bits 0-15: Auto-reload value (Low 16 bits) */
    uint32_t arr_h       : 16; /* Bits 16-31: Auto-reload value (High 16 bits, reserved in TIM3) */
} TIM_ARR_t;

#define ADDR_TIM3_ARR       ((volatile TIM_ARR_t*)(ADDR_TIM3_BASE + TIM_OFFSET_ARR))
#define ADDR_TIM4_ARR       ((volatile TIM_ARR_t*)(ADDR_TIM4_BASE + TIM_OFFSET_ARR))


/* TIMx_CCR1 */
typedef union
{
    struct
    {
        uint32_t ccr1_l      : 16; /* Bits 0-15: Capture/Compare 1 value (low elements) */
        uint32_t ccr1_h      : 16; /* Bits 16-31: Capture/Compare 1 value (high elements, depending on timers) */
    };
    uint32_t reg;
} TIM_CCR1_t;

/* Direcciones de memoria para TIMx_CCR1 */
#define ADDR_TIM3_CCR1      ((volatile TIM_CCR1_t*)(ADDR_TIM3_BASE + TIM_OFFSET_CCR1))
#define ADDR_TIM4_CCR1      ((volatile TIM_CCR1_t*)(ADDR_TIM4_BASE + TIM_OFFSET_CCR1))


/****************************************  NVIC *******************************************/
#define ADDR_NVIC_BASE      0xE000E000UL
#define NVIC_OFFSET_ISER0   0x100UL
#define NVIC_OFFSET_ISER1   0x104UL
#define NVIC_OFFSET_IPR7    0x41CUL

/* NVIC_ISER0 */
typedef struct
{
    uint32_t wwdg            : 1;  /* Bit 0: Window Watchdog interrupt */
    uint32_t pvd             : 1;  /* Bit 1: PVD through EXTI line detection */
    uint32_t tamp_stamp      : 1;  /* Bit 2: Tamper and TimeStamp interrupts */
    uint32_t rtc_wkup        : 1;  /* Bit 3: RTC Wakeup interrupt through EXTI */
    uint32_t flash           : 1;  /* Bit 4: Flash global interrupt */
    uint32_t rcc             : 1;  /* Bit 5: RCC global interrupt */
    uint32_t exti0           : 1;  /* Bit 6: EXTI Line0 interrupt */
    uint32_t exti1           : 1;  /* Bit 7: EXTI Line1 interrupt */
    uint32_t exti2           : 1;  /* Bit 8: EXTI Line2 interrupt */
    uint32_t exti3           : 1;  /* Bit 9: EXTI Line3 interrupt */
    uint32_t exti4           : 1;  /* Bit 10: EXTI Line4 interrupt */
    uint32_t dma1_stream0    : 1;  /* Bit 11: DMA1 Stream0 global interrupt */
    uint32_t dma1_stream1    : 1;  /* Bit 12: DMA1 Stream1 global interrupt */
    uint32_t dma1_stream2    : 1;  /* Bit 13: DMA1 Stream2 global interrupt */
    uint32_t dma1_stream3    : 1;  /* Bit 14: DMA1 Stream3 global interrupt */
    uint32_t dma1_stream4    : 1;  /* Bit 15: DMA1 Stream4 global interrupt */
    uint32_t dma1_stream5    : 1;  /* Bit 16: DMA1 Stream5 global interrupt */
    uint32_t dma1_stream6    : 1;  /* Bit 17: DMA1 Stream6 global interrupt */
    uint32_t adc             : 1;  /* Bit 18: ADC1, ADC2 and ADC3 global interrupts */
    uint32_t can1_tx         : 1;  /* Bit 19: CAN1 TX interrupts */
    uint32_t can1_rx0        : 1;  /* Bit 20: CAN1 RX0 interrupts */
    uint32_t can1_rx1        : 1;  /* Bit 21: CAN1 RX1 interrupts */
    uint32_t can1_sce        : 1;  /* Bit 22: CAN1 SCE interrupt */
    uint32_t exti9_5         : 1;  /* Bit 23: EXTI Line[9:5] interrupts */
    uint32_t tim1_brk_tim9   : 1;  /* Bit 24: TIM1 Break and TIM9 global interrupt */
    uint32_t tim1_up_tim10   : 1;  /* Bit 25: TIM1 Update and TIM10 global interrupt */
    uint32_t tim1_trg_com_tim11 : 1; /* Bit 26: TIM1 Trigger/Commutation and TIM11 */
    uint32_t tim1_cc         : 1;  /* Bit 27: TIM1 Capture Compare interrupt */
    uint32_t tim2            : 1;  /* Bit 28: TIM2 global interrupt */
    uint32_t tim3            : 1;  /* Bit 29: TIM3 global interrupt */
    uint32_t tim4            : 1;  /* Bit 30: TIM4 global interrupt */
    uint32_t i2c1_ev         : 1;  /* Bit 31: I2C1 event interrupt */
} NVIC_ISER0_t;

#define ADDR_NVIC_ISER0     ((volatile NVIC_ISER0_t*)(ADDR_NVIC_BASE + NVIC_OFFSET_ISER0))

/* NVIC_ISER1 (Interrupts 32 to 63) */
typedef struct
{
    uint32_t i2c1_er           : 1;  /* Bit 0: I2C1 error interrupt */
    uint32_t i2c2_ev           : 1;  /* Bit 1: I2C2 event interrupt */
    uint32_t i2c2_er           : 1;  /* Bit 2: I2C2 error interrupt */
    uint32_t spi1              : 1;  /* Bit 3: SPI1 global interrupt */
    uint32_t spi2              : 1;  /* Bit 4: SPI2 global interrupt */
    uint32_t usart1            : 1;  /* Bit 5: USART1 global interrupt */
    uint32_t usart2            : 1;  /* Bit 6: USART2 global interrupt */
    uint32_t usart3            : 1;  /* Bit 7: USART3 global interrupt */
    uint32_t exti15_10         : 1;  /* Bit 8: EXTI Line[15:10] interrupts */
    uint32_t rtc_alarm         : 1;  /* Bit 9: RTC Alarms (A and B) through EXTI line interrupt */
    uint32_t otg_fs_wkup       : 1;  /* Bit 10: USB On-The-Go FS Wakeup through EXTI line interrupt */
    uint32_t tim8_brk_tim12    : 1;  /* Bit 11: TIM8 Break interrupt and TIM12 global interrupt */
    uint32_t tim8_up_tim13     : 1;  /* Bit 12: TIM8 Update interrupt and TIM13 global interrupt */
    uint32_t tim8_trg_com_tim14: 1;  /* Bit 13: TIM8 Trigger/Commutation and TIM14 global interrupt */
    uint32_t tim8_cc           : 1;  /* Bit 14: TIM8 Capture Compare interrupt */
    uint32_t dma1_stream7      : 1;  /* Bit 15: DMA1 Stream7 global interrupt */
    uint32_t fsmc              : 1;  /* Bit 16: FSMC global interrupt */
    uint32_t sdio              : 1;  /* Bit 17: SDIO global interrupt */
    uint32_t tim5              : 1;  /* Bit 18: TIM5 global interrupt */
    uint32_t spi3              : 1;  /* Bit 19: SPI3 global interrupt */
    uint32_t uart4             : 1;  /* Bit 20: UART4 global interrupt */
    uint32_t uart5             : 1;  /* Bit 21: UART5 global interrupt */
    uint32_t tim6_dac          : 1;  /* Bit 22: TIM6 global interrupt, DAC1 and DAC2 underrun interrupts */
    uint32_t tim7              : 1;  /* Bit 23: TIM7 global interrupt */
    uint32_t dma2_stream0      : 1;  /* Bit 24: DMA2 Stream0 global interrupt */
    uint32_t dma2_stream1      : 1;  /* Bit 25: DMA2 Stream1 global interrupt */
    uint32_t dma2_stream2      : 1;  /* Bit 26: DMA2 Stream2 global interrupt */
    uint32_t dma2_stream3      : 1;  /* Bit 27: DMA2 Stream3 global interrupt */
    uint32_t dma2_stream4      : 1;  /* Bit 28: DMA2 Stream4 global interrupt */
    uint32_t eth               : 1;  /* Bit 29: Ethernet global interrupt */
    uint32_t eth_wkup          : 1;  /* Bit 30: Ethernet Wakeup through EXTI line interrupt */
    uint32_t can2_tx           : 1;  /* Bit 31: CAN2 TX interrupts */
} NVIC_ISER1_t;

#define ADDR_NVIC_ISER1     ((volatile NVIC_ISER1_t*)(ADDR_NVIC_BASE + NVIC_OFFSET_ISER1))


/* NVIC_IPR7 */
typedef struct
{
    /* Bits 0-7: Interrupt 28 (TIM2) Priority */
    uint32_t tim2_reserved   : 4;  /* Bits 0-3: Read as zero, ignore writes */
    uint32_t tim2_priority   : 4;  /* Bits 4-7: Priority, implements bits [7:4] */

    /* Bits 8-15: Interrupt 29 (TIM3) Priority */
    uint32_t tim3_reserved   : 4;  /* Bits 8-11: Read as zero, ignore writes */
    uint32_t tim3_priority   : 4;  /* Bits 12-15: Priority, implements bits [7:4] */

    /* Bits 16-23: Interrupt 30 (TIM4) Priority */
    uint32_t tim4_reserved   : 4;  /* Bits 16-19: Read as zero, ignore writes */
    uint32_t tim4_priority   : 4;  /* Bits 20-23: Priority, implements bits [7:4] */

    /* Bits 24-31: Interrupt 31 (I2C1_EV) Priority */
    uint32_t i2c1_ev_reserved: 4;  /* Bits 24-27: Read as zero, ignore writes */
    uint32_t i2c1_ev_priority: 4;  /* Bits 28-31: Priority, implements bits [7:4] */
} NVIC_IPR7_t;

#define ADDR_NVIC_IPR7      ((volatile NVIC_IPR7_t*)(ADDR_NVIC_BASE + NVIC_OFFSET_IPR7))


