VictorDanielHerHur/Librer-a-/stm32f407g (2).h
/******************************************** DMA ********************************************************* */
/* DMA_LISR */
#define NUM_DMA_STREAMS 8U
#define ADDR_DMA1_BASE      0x40026000UL
#define ADDR_DMA2_BASE      0x40026400UL

typedef union
{
    struct
    {
        // --- Bits 0 a 15 (Stream 0 y 1) ---
        uint32_t FEIF0    : 1;  // Bit 0: Stream 0 FIFO error interrupt flag
        uint32_t Reserved0: 1;  // Bit 1: Reservado
        uint32_t DMEIF0   : 1;  // Bit 2: Stream 0 Direct mode error interrupt flag
        uint32_t TEIF0    : 1;  // Bit 3: Stream 0 Transfer error interrupt flag
        uint32_t HTIF0    : 1;  // Bit 4: Stream 0 Half transfer interrupt flag
        uint32_t TCIF0    : 1;  // Bit 5: Stream 0 Transfer complete interrupt flag
        
        uint32_t FEIF1    : 1;  // Bit 6: Stream 1 FIFO error interrupt flag
        uint32_t Reserved1: 1;  // Bit 7: Reservado
        uint32_t DMEIF1   : 1;  // Bit 8: Stream 1 Direct mode error interrupt flag
        uint32_t TEIF1    : 1;  // Bit 9: Stream 1 Transfer error interrupt flag
        uint32_t HTIF1    : 1;  // Bit 10: Stream 1 Half transfer interrupt flag
        uint32_t TCIF1    : 1;  // Bit 11: Stream 1 Transfer complete interrupt flag
        
        uint32_t Reserved2 : 4; // Bits 12 a 15: Reservados

        // --- Bits 16 a 31 (Stream 2 y 3) ---
        uint32_t FEIF2    : 1;  // Bit 16: Stream 2 FIFO error interrupt flag
        uint32_t Reserved3: 1;  // Bit 17: Reservado
        uint32_t DMEIF2   : 1;  // Bit 18: Stream 2 Direct mode error interrupt flag
        uint32_t TEIF2    : 1;  // Bit 19: Stream 2 Transfer error interrupt flag
        uint32_t HTIF2    : 1;  // Bit 20: Stream 2 Half transfer interrupt flag
        uint32_t TCIF2    : 1;  // Bit 21: Stream 2 Transfer complete interrupt flag
        
        uint32_t FEIF3    : 1;  // Bit 22: Stream 3 FIFO error interrupt flag
        uint32_t Reserved4: 1;  // Bit 23: Reservado
        uint32_t DMEIF3   : 1;  // Bit 24: Stream 3 Direct mode error interrupt flag
        uint32_t TEIF3    : 1;  // Bit 25: Stream 3 Transfer error interrupt flag
        uint32_t HTIF3    : 1;  // Bit 26: Stream 3 Half transfer interrupt flag
        uint32_t TCIF3    : 1;  // Bit 27: Stream 3 Transfer complete interrupt flag
        
        uint32_t Reserved5 : 4; // Bits 28 a 31: Reservados
    }bit;
    uint32_t reg;
} DMA_LISR_REG_t;

/* DMA_HISR */

typedef union
{
    struct
    {
        // --- Bits 0 a 15 (Stream 4 y 5) ---
        uint32_t FEIF4    : 1;  // Bit 0: Stream 4 FIFO error interrupt flag
        uint32_t Reserved1: 1;  // Bit 1: Reservado
        uint32_t DMEIF4   : 1;  // Bit 2: Stream 4 Direct mode error interrupt flag
        uint32_t TEIF4    : 1;  // Bit 3: Stream 4 Transfer error interrupt flag
        uint32_t HTIF4    : 1;  // Bit 4: Stream 4 Half transfer interrupt flag
        uint32_t TCIF4    : 1;  // Bit 5: Stream 4 Transfer complete interrupt flag
        
        uint32_t FEIF5    : 1;  // Bit 6: Stream 5 FIFO error interrupt flag
        uint32_t Reserved2: 1;  // Bit 7: Reservado
        uint32_t DMEIF5   : 1;  // Bit 8: Stream 5 Direct mode error interrupt flag
        uint32_t TEIF5    : 1;  // Bit 9: Stream 5 Transfer error interrupt flag
        uint32_t HTIF5    : 1;  // Bit 10: Stream 5 Half transfer interrupt flag
        uint32_t TCIF5    : 1;  // Bit 11: Stream 5 Transfer complete interrupt flag
        
        uint32_t Reserved3 : 4; // Bits 12 a 15: Reservados

        // --- Bits 16 a 31 (Stream 6 y 7) ---
        uint32_t FEIF6    : 1;  // Bit 16: Stream 6 FIFO error interrupt flag
        uint32_t Reserved4: 1;  // Bit 17: Reservado
        uint32_t DMEIF6   : 1;  // Bit 18: Stream 6 Direct mode error interrupt flag
        uint32_t TEIF6    : 1;  // Bit 19: Stream 6 Transfer error interrupt flag
        uint32_t HTIF6    : 1;  // Bit 20: Stream 6 Half transfer interrupt flag
        uint32_t TCIF6    : 1;  // Bit 21: Stream 6 Transfer complete interrupt flag
        
        uint32_t FEIF7    : 1;  // Bit 22: Stream 7 FIFO error interrupt flag
        uint32_t Reserved5: 1;  // Bit 23: Reservado
        uint32_t DMEIF7   : 1;  // Bit 24: Stream 7 Direct mode error interrupt flag
        uint32_t TEIF7    : 1;  // Bit 25: Stream 7 Transfer error interrupt flag
        uint32_t HTIF7    : 1;  // Bit 26: Stream 7 Half transfer interrupt flag
        uint32_t TCIF7    : 1;  // Bit 27: Stream 7 Transfer complete interrupt flag
        
        uint32_t Reserved_28_31 : 4; // Bits 28 a 31: Reservados
    }bit;
    uint32_t reg;
} DMA_HISR_REG_t;


/* DMA_LIFCR */

typedef union
{
    struct
    {
        // --- Bits 0 a 15 (Stream 0 y 1) ---
        uint32_t CFEIF0   : 1;  // Bit 0: Clear Stream 0 FIFO error interrupt flag
        uint32_t Reserved1: 1;  // Bit 1: Reservado
        uint32_t CDMEIF0  : 1;  // Bit 2: Clear Stream 0 Direct mode error interrupt flag
        uint32_t CTEIF0   : 1;  // Bit 3: Clear Stream 0 Transfer error interrupt flag
        uint32_t CHTIF0   : 1;  // Bit 4: Clear Stream 0 Half transfer interrupt flag
        uint32_t CTCIF0   : 1;  // Bit 5: Clear Stream 0 Transfer complete interrupt flag
        
        uint32_t CFEIF1   : 1;  // Bit 6: Clear Stream 1 FIFO error interrupt flag
        uint32_t Reserved2: 1;  // Bit 7: Reservado
        uint32_t CDMEIF1  : 1;  // Bit 8: Clear Stream 1 Direct mode error interrupt flag
        uint32_t CTEIF1   : 1;  // Bit 9: Clear Stream 1 Transfer error interrupt flag
        uint32_t CHTIF1   : 1;  // Bit 10: Clear Stream 1 Half transfer interrupt flag
        uint32_t CTCIF1   : 1;  // Bit 11: Clear Stream 1 Transfer complete interrupt flag
        
        uint32_t Reserved3 : 4; // Bits 12 a 15: Reservados

        // --- Bits 16 a 31 (Stream 2 y 3) ---
        uint32_t CFEIF2   : 1;  // Bit 16: Clear Stream 2 FIFO error interrupt flag
        uint32_t Reserved4: 1;  // Bit 17: Reservado
        uint32_t CDMEIF2  : 1;  // Bit 18: Clear Stream 2 Direct mode error interrupt flag
        uint32_t CTEIF2   : 1;  // Bit 19: Clear Stream 2 Transfer error interrupt flag
        uint32_t CHTIF2   : 1;  // Bit 20: Clear Stream 2 Half transfer interrupt flag
        uint32_t CTCIF2   : 1;  // Bit 21: Clear Stream 2 Transfer complete interrupt flag
        
        uint32_t CFEIF3   : 1;  // Bit 22: Clear Stream 3 FIFO error interrupt flag
        uint32_t Reserved5: 1;  // Bit 23: Reservado
        uint32_t CDMEIF3  : 1;  // Bit 24: Clear Stream 3 Direct mode error interrupt flag
        uint32_t CTEIF3   : 1;  // Bit 25: Clear Stream 3 Transfer error interrupt flag
        uint32_t CHTIF3   : 1;  // Bit 26: Clear Stream 3 Half transfer interrupt flag
        uint32_t CTCIF3   : 1;  // Bit 27: Clear Stream 3 Transfer complete interrupt flag
        
        uint32_t Reserved6 : 4; // Bits 28 a 31: Reservados
    }bit;
    uint32_t reg;
} DMA_LIFCR_REG_t;

/* DMA_HIFCR */

typedef union
{
    struct
    {
        // --- Bits 0 a 15 (Stream 4 y 5) ---
        uint32_t CFEIF4   : 1;  // Bit 0: Clear Stream 4 FIFO error interrupt flag
        uint32_t Reserved1: 1;  // Bit 1: Reservado
        uint32_t CDMEIF4  : 1;  // Bit 2: Clear Stream 4 Direct mode error interrupt flag
        uint32_t CTEIF4   : 1;  // Bit 3: Clear Stream 4 Transfer error interrupt flag
        uint32_t CHTIF4   : 1;  // Bit 4: Clear Stream 4 Half transfer interrupt flag
        uint32_t CTCIF4   : 1;  // Bit 5: Clear Stream 4 Transfer complete interrupt flag
        
        uint32_t CFEIF5   : 1;  // Bit 6: Clear Stream 5 FIFO error interrupt flag
        uint32_t Reserved2: 1;  // Bit 7: Reservado
        uint32_t CDMEIF5  : 1;  // Bit 8: Clear Stream 5 Direct mode error interrupt flag
        uint32_t CTEIF5   : 1;  // Bit 9: Clear Stream 5 Transfer error interrupt flag
        uint32_t CHTIF5   : 1;  // Bit 10: Clear Stream 5 Half transfer interrupt flag
        uint32_t CTCIF5   : 1;  // Bit 11: Clear Stream 5 Transfer complete interrupt flag
        
