VictorDanielHerHur/Librer-a-/stm32f407g (2).h
        uint32_t Reserved3 : 4; // Bits 12 a 15: Reservados

        // --- Bits 16 a 31 (Stream 6 y 7) ---
        uint32_t CFEIF6   : 1;  // Bit 16: Clear Stream 6 FIFO error interrupt flag
        uint32_t Reserved4: 1;  // Bit 17: Reservado
        uint32_t CDMEIF6  : 1;  // Bit 18: Clear Stream 6 Direct mode error interrupt flag
        uint32_t CTEIF6   : 1;  // Bit 19: Clear Stream 6 Transfer error interrupt flag
        uint32_t CHTIF6   : 1;  // Bit 20: Clear Stream 6 Half transfer interrupt flag
        uint32_t CTCIF6   : 1;  // Bit 21: Clear Stream 6 Transfer complete interrupt flag
        
        uint32_t CFEIF7   : 1;  // Bit 22: Clear Stream 7 FIFO error interrupt flag
        uint32_t Reserved5: 1;  // Bit 23: Reservado
        uint32_t CDMEIF7  : 1;  // Bit 24: Clear Stream 7 Direct mode error interrupt flag
        uint32_t CTEIF7   : 1;  // Bit 25: Clear Stream 7 Transfer error interrupt flag
        uint32_t CHTIF7   : 1;  // Bit 26: Clear Stream 7 Half transfer interrupt flag
        uint32_t CTCIF7   : 1;  // Bit 27: Clear Stream 7 Transfer complete interrupt flag
        
        uint32_t Reserved6 : 4; // Bits 28 a 31: Reservados
    }bit;
    uint32_t reg;
} DMA_HIFCR_REG_t;


/* DMA_SxCR */

typedef union{
    struct
    {
        // --- Bits 0 a 15 ---
        uint32_t EN       : 1;  // Bit 0: Stream enable / flag de transferencia activa
        uint32_t DMEIE    : 1;  // Bit 1: Direct mode error interrupt enable
        uint32_t TEIE     : 1;  // Bit 2: Transfer error interrupt enable
        uint32_t HTIE     : 1;  // Bit 3: Half transfer interrupt enable
        uint32_t TCIE     : 1;  // Bit 4: Transfer complete interrupt enable
        uint32_t PFCTRL   : 1;  // Bit 5: Peripheral flow controller
        uint32_t DIR      : 2;  // Bits 6-7: Data transfer direction (00: P-to-M, 01: M-to-P, 10: M-to-M)
        uint32_t CIRC     : 1;  // Bit 8: Circular mode
        uint32_t PINC     : 1;  // Bit 9: Peripheral increment mode
        uint32_t MINC     : 1;  // Bit 10: Memory increment mode
        uint32_t PSIZE    : 2;  // Bits 11-12: Peripheral data size (00: 8-bit, 01: 16-bit, 10: 32-bit)
        uint32_t MSIZE    : 2;  // Bits 13-14: Memory data size (00: 8-bit, 01: 16-bit, 10: 32-bit)
        uint32_t PINCOS   : 1;  // Bit 15: Peripheral increment offset size

        // --- Bits 16 a 31 ---
        uint32_t PL       : 2;  // Bits 16-17: Priority level (00: Low, 01: Medium, 10: High, 11: Very high)
        uint32_t DBM      : 1;  // Bit 18: Double buffer mode
        uint32_t CT       : 1;  // Bit 19: Current target (solo en Double buffer mode)
        uint32_t Reserved1: 1;  // Bit 20: Reservado
        uint32_t PBURST   : 2;  // Bits 21-22: Peripheral burst transfer configuration
        uint32_t MBURST   : 2;  // Bits 23-24: Memory burst transfer configuration
        uint32_t CHSEL    : 3;  // Bits 25-27: Channel selection (Selecciona canal del 0 al 7)
        uint32_t Reserved2 : 4; // Bits 28-31: Reservados
    }bit;
    uint32_t reg;
} DMA_CR_REG_t;


/* DMA_SxNDTR */

typedef union
{
    struct
    {
        uint32_t NDT      : 16; // Bits 0-15: Number of data items to transfer
        uint32_t Reserved : 16; // Bits 16-31: Reservados, se leen como 0
    }bit;
    uint32_t reg;
} DMA_NDTR_REG_t;

/* DMA_SxPAR */

typedef union{
    struct
    {
        uint32_t PAR : 32; // Bits 0-31: Peripheral address
    }bit;
    uint32_t reg;
} DMA_PAR_REG_t;

/* DMA_SxM0AR */

typedef union
{
    struct
    {
        uint32_t M0A : 32; // Bits 0-31: Memory 0 address
    }bit;
    uint32_t reg;
} DMA_M0AR_REG_t;

/* DMA_SxM1AR */

typedef union
{
    struct
    {
        uint32_t M1A : 32; // Bits 0-31: Memory 1 address
    }bit;
    uint32_t reg;
} DMA_M1AR_REG_t;


/* DMA_SxFCR */

typedef union{
    struct
    {
        // --- Bits 0 a 15 ---
        uint32_t FTH      : 2;  // Bits 0-1: FIFO threshold selection (00: 1/4, 01: 1/2, 10: 3/4, 11: full)
        uint32_t DMDIS    : 1;  // Bit 2: Direct mode disable
        uint32_t FS       : 3;  // Bits 3-5: FIFO status (Read-only)
        uint32_t Reserved1: 1;  // Bit 6: Reservado
        uint32_t FEIE     : 1;  // Bit 7: FIFO error interrupt enable
        uint32_t Reserved2 : 8; // Bits 8-15: Reservados

        // --- Bits 16 a 31 ---
        uint32_t Reserved3 : 16; // Bits 16-31: Reservados
    }bit;
    uint32_t reg;
} DMA_FCR_REG_t;

/* DMA_Sx */
typedef struct
{
    volatile DMA_CR_REG_t   CR;     // Offset: 0x00
    volatile DMA_NDTR_REG_t NDTR;   // Offset: 0x04
    volatile DMA_PAR_REG_t  PAR;    // Offset: 0x08
    volatile DMA_M0AR_REG_t M0AR;   // Offset: 0x0C
    volatile DMA_M1AR_REG_t M1AR;   // Offset: 0x10
    volatile DMA_FCR_REG_t  FCR;    // Offset: 0x14
} DMA_Stream_TypeDef;

/* DMA */
typedef struct
{
    volatile DMA_LISR_REG_t  LISR;   // Offset: 0x00
    volatile DMA_HISR_REG_t  HISR;   // Offset: 0x04
    volatile DMA_LIFCR_REG_t LIFCR;  // Offset: 0x08
    volatile DMA_HIFCR_REG_t HIFCR;  // Offset: 0x0C
    
    // El arreglo comienza en el offset 0x10 de forma consecutiva
    DMA_Stream_TypeDef       Sx[NUM_DMA_STREAMS]; 
} DMA_TypeDef;

#define DMA1     ((volatile DMA_TypeDef *)(ADDR_DMA1_BASE))
#define DMA2     ((volatile DMA_TypeDef *)(ADDR_DMA2_BASE))


/********************************************** USART ***************************************************/
#define ADDR_USART2_BASE    0x40004400UL
#define USART_OFFSET_SR     0x00UL
#define USART_OFFSET_DR     0x04UL
#define USART_OFFSER_BRR    0x08UL
#define USART_OFFSET_CR1    0x0CUL

/* USART_SR */
typedef struct
{
    uint32_t PE         : 1;    // Bit 0: Parity error
    uint32_t FE         : 1;    // Bit 1: Framing error
    uint32_t NF         : 1;    // Bit 2: Noise detected flag
    uint32_t ORE        : 1;    // Bit 3: Overrun error
    uint32_t IDLE       : 1;    // Bit 4: IDLE line detected
    uint32_t RXNE       : 1;    // Bit 5: Read data register not empty
    uint32_t TC         : 1;    // Bit 6: Transmission complete
    uint32_t TXE        : 1;    // Bit 7: Transmit data register empty
    uint32_t LBD        : 1;    // Bit 8: LIN break detection flag
    uint32_t CTS        : 1;    // Bit 9: CTS flag
    uint32_t Reserved   : 22;   // Bits 10:31 Reserved, must be kept at reset value
} USART_SR_t;

