VictorDanielHerHur/Librer-a-/stm32f407g (2).h
#define ADDR_USART2_SR      ((volatile USART_SR_t*)(ADDR_USART2_BASE + USART_OFFSET_SR))

/* USART_DR */
typedef struct
{
    uint32_t DR         : 9;    // Bits 0:8 Data value (Received or Transmitted character)
    uint32_t Reserved   : 23;   // Bits 9:31 Reserved, must be kept at reset value
} USART_DR_t;

#define ADDR_USART2_DR      ((volatile USART_DR_t*)(ADDR_USART2_BASE + USART_OFFSET_DR))

/* USART_BRR */
typedef struct
{
    uint32_t DIV_Fraction   : 4;    // Bits 0:3 fraction of USARTDIV
    uint32_t DIV_Mantissa   : 12;   // Bits 4:15 mantissa of USARTDIV
    uint32_t Reserved       : 16;   // Bits 16:31 Reserved, must be kept at reset value
}USART_BRR_t;

#define ADDR_USART2_BRR        ((volatile USART_BRR_t*)(ADDR_USART2_BASE + USART_OFFSER_BRR))

/* USART CR1 */
typedef struct
{
    uint32_t SBK        : 1;    // Bit 0: Send break
    uint32_t RWU        : 1;    // Bit 1: Receiver wakeup
    uint32_t RE         : 1;    // Bit 2: Receiver enable
    uint32_t TE         : 1;    // Bit 3: Transmitter enable
    uint32_t IDLEIE     : 1;    // Bit 4: IDLE interrupt enable
    uint32_t RXNEIE     : 1;    // Bit 5: RXNE interrupt enable
    uint32_t TCIE       : 1;    // Bit 6: Transmission complete interrupt enable
    uint32_t TXEIE      : 1;    // Bit 7: TXE interrupt enable
    uint32_t PEIE       : 1;    // Bit 8: PE interrupt enable
    uint32_t PS         : 1;    // Bit 9: Parity selection
    uint32_t PCE        : 1;    // Bit 10: Parity control enable
    uint32_t WAKE       : 1;    // Bit 11: Wakeup method
    uint32_t M          : 1;    // Bit 12: Word length
    uint32_t UE         : 1;    // Bit 13: USART enable
    uint32_t Reserved1  : 1;    // Bit 14: Reserved, must be kept at reset value
    uint32_t OVER8      : 1;    // Bit 15: Oversampling mode
    uint32_t Reserved2  : 16;   // Bits 16:31 Reserved, must be kept at reset value
} USART_CR1_t;

#define ADDR_USART2_CR1     ((volatile USART_CR1_t*)(ADDR_USART2_BASE + USART_OFFSET_CR1))

/*************************************** Sys_clock_cfg_168 MHz ******************************************/
#define ADDR_FLASH_ACR    ((volatile uint32_t*)0x40023C00)

void SystemClock_Config_168MHz(void) {
    // -------------------------------------------------------------------------
    // 1. Modificar el registro RCC_CR utilizando punteros directos a memoria
    //    ya que estos campos específicos no venían en las estructuras provistas.
    // -------------------------------------------------------------------------
    volatile uint32_t *RCC_CR = (volatile uint32_t *)(ADDR_RCC_BASE + 0x00);

    // Encender el oscilador externo HSE (Bit 16: HSEON = 1)
    *RCC_CR |= (1 << 16);

    // Esperar a que el HSE esté listo y estable (Monitorear Bit 17: HSERDY == 1)
    while (!(*RCC_CR & (1 << 17))) {
        // Espera bloqueante hasta que el cristal de 8MHz se estabilice
    }

    // -------------------------------------------------------------------------
    // 2. Configurar el regulador de voltaje y la latencia de la Memoria Flash
    //    Es obligatorio antes de subir la velocidad para evitar corrupción de datos.
    // -------------------------------------------------------------------------
    // Habilitar el reloj del regulador de energía (Power Interface)
    // En tu estructura de APB2ENR no está, lo hacemos por desplazamiento en APB1ENR (Bit 28)
    volatile uint32_t *RCC_APB1ENR = (volatile uint32_t *)(ADDR_RCC_BASE + 0x40);
    *RCC_APB1ENR |= (1 << 28);

    // Registro de control de energía (PWR_CR Bit 14: VOS = 1 Modo de alto rendimiento)
    volatile uint32_t *PWR_CR = (volatile uint32_t *)0x40007000;
    *PWR_CR |= (1 << 14);

    // Configurar Latencia Flash a 5 ciclos de espera (Bits 2:0 = 101 o 5 decimal)
    // Además habilitamos el Prefetch y las cachés de instrucciones/datos (Bits 8, 9, 10)
    *ADDR_FLASH_ACR = (5 << 0) | (1 << 8) | (1 << 9) | (1 << 10);

    // -------------------------------------------------------------------------
    // 3. Configurar los divisores de los buses internos (Prescalers)
    //    Modificamos el registro de configuración de reloj por direccionamiento directo
    // -------------------------------------------------------------------------
    volatile uint32_t *RCC_CFGR = (volatile uint32_t *)(ADDR_RCC_BASE + 0x08);

    // HPRE  (Bits 7:4)   = 0xxx -> AHB Prescaler = /1  (Queda en 168 MHz)
    // PPRE1 (Bits 12:10) = 101  -> APB1 Prescaler = /4 (Queda en 42 MHz)
    // PPRE2 (Bits 15:13) = 100  -> APB2 Prescaler = /2 (Queda en 84 MHz) -> ¡TU f_PCLK2!
    *RCC_CFGR &= ~((0xF << 4) | (7 << 10) | (7 << 13)); // Limpiar bits antiguos
    *RCC_CFGR |=  (0 << 4)  | (5 << 10) | (4 << 13);

    // -------------------------------------------------------------------------
    // 4. Configurar los parámetros matemáticos del PLL multiplicador
    //    Fórmula: VCO = (HSE / M) * N  --> (8MHz / 8) * 336 = 336 MHz
    //    SYSCLK = VCO / P             --> 336MHz / 2       = 168 MHz
    // -------------------------------------------------------------------------
    volatile uint32_t *RCC_PLLCFGR = (volatile uint32_t *)(ADDR_RCC_BASE + 0x04);

    *RCC_PLLCFGR = 0; // Limpieza inicial
    *RCC_PLLCFGR |= (8 << 0);    // PLLM: Divisor de entrada = 8
    *RCC_PLLCFGR |= (336 << 6);  // PLLN: Multiplicador de lazo = 336
    *RCC_PLLCFGR |= (0 << 16);   // PLLP: Divisor final /2 (El valor 00 significa /2)
    *RCC_PLLCFGR |= (1 << 22);   // PLLSRC: Seleccionar HSE como la fuente del PLL
    *RCC_PLLCFGR |= (7 << 24);   // PLLQ: Divisor para el USB OTG (336MHz / 7 = 48MHz exactos)

    // -------------------------------------------------------------------------
    // 5. Encender el PLL y realizar el cambio de reloj del sistema
    // -------------------------------------------------------------------------
    // Activar el PLL principal (Bit 24: PLLON = 1 en RCC_CR)
    *RCC_CR |= (1 << 24);

    // Esperar a que el PLL se enganche y esté listo (Monitorear Bit 25: PLLRDY == 1)
    while (!(*RCC_CR & (1 << 25))) {
        // Espera bloqueante
    }

